[Killed] BlockStatement
src/application/TransferenciaServico.ts:11:63
 export class TransferenciaServico {
   private _repositorio: Repositorio<string, Conta>;
 
-  public constructor(repositorio: Repositorio<string, Conta>) {
-    this._repositorio = repositorio;
-  }
+  public constructor(repositorio: Repositorio<string, Conta>) {}
 
   public async transferir(dto: TransferenciaDTO): Promise<string> {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'buscar')

[Killed] BlockStatement
src/application/TransferenciaServico.ts:15:67
     this._repositorio = repositorio;
   }
 
-  public async transferir(dto: TransferenciaDTO): Promise<string> {
-    const contaOrigem = await this._repositorio.buscar(dto.contaOrigem);
-    const contaDestino = await this._repositorio.buscar(dto.contaDestino);
-
-    if (!contaOrigem) throw new NegocioErro("conta de origem não encontrada");
-
-    if (!contaDestino) throw new NegocioErro("conta de destino não encontrada");
-
-    const transferencia: TransferenciaValor = new TransferenciaValor();
-    const recibo: Recibo = transferencia.transferir(
-      contaOrigem,
-      contaDestino,
-      dto.valor
-    );
-
-    this._repositorio.adicionar(contaOrigem);
-    this._repositorio.adicionar(contaDestino);
-
-    return recibo.codigo;
-  }
+  public async transferir(dto: TransferenciaDTO): Promise<string> {}
 }
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "123456"

Number of calls: 0

[Killed] ConditionalExpression
src/application/TransferenciaServico.ts:19:9
     const contaOrigem = await this._repositorio.buscar(dto.contaOrigem);
     const contaDestino = await this._repositorio.buscar(dto.contaDestino);
 
-    if (!contaOrigem) throw new NegocioErro("conta de origem não encontrada");
+    if (false) throw new NegocioErro("conta de origem não encontrada");
 
     if (!contaDestino) throw new NegocioErro("conta de destino não encontrada");
killedBy: Transferencia serviço mock conta de origem não encontrada
statusReason: Error: expect(received).rejects.toEqual(expected) // deep equality

Expected: [Error: conta de origem não encontrada]
Received: [TypeError: Cannot read properties of undefined (reading 'sacar')]

[Killed] ConditionalExpression
src/application/TransferenciaServico.ts:19:9
     const contaOrigem = await this._repositorio.buscar(dto.contaOrigem);
     const contaDestino = await this._repositorio.buscar(dto.contaDestino);
 
-    if (!contaOrigem) throw new NegocioErro("conta de origem não encontrada");
+    if (true) throw new NegocioErro("conta de origem não encontrada");
 
     if (!contaDestino) throw new NegocioErro("conta de destino não encontrada");
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: conta de origem não encontrada

[Killed] BooleanLiteral
src/application/TransferenciaServico.ts:21:9
 
     if (!contaOrigem) throw new NegocioErro("conta de origem não encontrada");
 
-    if (!contaDestino) throw new NegocioErro("conta de destino não encontrada");
+    if (contaDestino) throw new NegocioErro("conta de destino não encontrada");
 
     const transferencia: TransferenciaValor = new TransferenciaValor();
killedBy: Transferência Serviço transferir com sucesso
statusReason: Error: conta de destino não encontrada

[Killed] ConditionalExpression
src/application/TransferenciaServico.ts:21:9
 
     if (!contaOrigem) throw new NegocioErro("conta de origem não encontrada");
 
-    if (!contaDestino) throw new NegocioErro("conta de destino não encontrada");
+    if (true) throw new NegocioErro("conta de destino não encontrada");
 
     const transferencia: TransferenciaValor = new TransferenciaValor();
killedBy: Transferência Serviço transferir com sucesso
statusReason: Error: conta de destino não encontrada
