[Killed] BlockStatement
src/application/dto/TransferenciaDTO.ts:6:80
   public contaDestino: string;
   public valor: number;
 
-  public constructor(contaOrigem: string, contaDestino: string, valor: number) {
-    this.contaOrigem = contaOrigem;
-    this.contaDestino = contaDestino;
-    this.valor = valor;
-  }
+  public constructor(contaOrigem: string, contaDestino: string, valor: number) {}
 }
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: conta de origem não encontrada
