[Killed] BlockStatement
src/model/Conta.ts:8:53
   private _numeroConta: NumeroConta;
   private _saldo: number;
 
-  public constructor(numero: string, saldo: number) {
-    this._numeroConta = new NumeroConta(numero);
-    this._saldo = saldo;
-  }
+  public constructor(numero: string, saldo: number) {}
 
   public sacar(valor: number): void {
killedBy: Transferência Serviço transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'numero')

[Killed] BlockStatement
src/model/Conta.ts:13:37
     this._saldo = saldo;
   }
 
-  public sacar(valor: number): void {
-    this.validarValor(valor);
-
-    if (valor > this._saldo)
-      throw new NegocioErro("saldo indisponível para operação");
-
-    this._saldo -= valor;
-  }
+  public sacar(valor: number): void {}
 
   public depositar(valor: number): void {
killedBy: Conta sacar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4800
Received: 5000

[Killed] EqualityOperator
src/model/Conta.ts:16:9
   public sacar(valor: number): void {
     this.validarValor(valor);
 
-    if (valor > this._saldo)
+    if (valor >= this._saldo)
       throw new NegocioErro("saldo indisponível para operação");
 
killedBy: Conta sacar todo o saldo
statusReason: Error: saldo indisponível para operação

[Killed] ConditionalExpression
src/model/Conta.ts:16:9
   public sacar(valor: number): void {
     this.validarValor(valor);
 
-    if (valor > this._saldo)
+    if (false)
       throw new NegocioErro("saldo indisponível para operação");
 
killedBy: Conta sacar valor acima do saldo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "saldo indisponível para operação"

Received function did not throw

[Killed] AssignmentOperator
src/model/Conta.ts:19:5
     if (valor > this._saldo)
       throw new NegocioErro("saldo indisponível para operação");
 
-    this._saldo -= valor;
+    this._saldo += valor;
   }
 
killedBy: Conta sacar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4800
Received: 5200

[Killed] BlockStatement
src/model/Conta.ts:22:41
     this._saldo -= valor;
   }
 
-  public depositar(valor: number): void {
-    this.validarValor(valor);
-
-    this._saldo += valor;
-  }
+  public depositar(valor: number): void {}
 
   public get saldo(): number {
killedBy: Conta depositar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5200
Received: 5000

[Killed] AssignmentOperator
src/model/Conta.ts:25:5
   public depositar(valor: number): void {
     this.validarValor(valor);
 
-    this._saldo += valor;
+    this._saldo -= valor;
   }
 
killedBy: Conta depositar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5200
Received: 4800

[Killed] BlockStatement
src/model/Conta.ts:28:30
     this._saldo += valor;
   }
 
-  public get saldo(): number {
-    return this._saldo;
-  }
+  public get saldo(): number {}
 
   public get numero(): string {
killedBy: Conta sacar com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4800
Received: undefined

[Killed] BlockStatement
src/model/Conta.ts:32:31
     return this._saldo;
   }
 
-  public get numero(): string {
-    return this._numeroConta.numero;
-  }
+  public get numero(): string {}
 
   private validarValor(valor: number): void {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: conta de origem não encontrada

[Killed] BlockStatement
src/model/Conta.ts:36:45
     return this._numeroConta.numero;
   }
 
-  private validarValor(valor: number): void {
-    if (valor <= 0)
-      throw new NegocioErro("valor não pode ser igual ou menor que zero");
-  }
+  private validarValor(valor: number): void {}
 }
 
killedBy: Conta sacar com valor zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "valor não pode ser igual ou menor que zero"

Received function did not throw

[Killed] ConditionalExpression
src/model/Conta.ts:37:9
   }
 
   private validarValor(valor: number): void {
-    if (valor <= 0)
+    if (false)
       throw new NegocioErro("valor não pode ser igual ou menor que zero");
   }
killedBy: Conta sacar com valor zerado
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "valor não pode ser igual ou menor que zero"

Received function did not throw

[Killed] EqualityOperator
src/model/Conta.ts:37:9
   }
 
   private validarValor(valor: number): void {
-    if (valor <= 0)
+    if (valor > 0)
       throw new NegocioErro("valor não pode ser igual ou menor que zero");
   }
killedBy: Conta sacar com sucesso
statusReason: Error: valor não pode ser igual ou menor que zero
