[Killed] BlockStatement
src/model/NumeroConta.ts:6:41
 export class NumeroConta {
   private _numero: string;
 
-  private validar(numero: string): void {
-    if (!this.temSeisDigitos(numero)) {
-      throw new NegocioErro("número de conta inválida");
-    }
-  }
+  private validar(numero: string): void {}
 
   private temSeisDigitos(numero: string): boolean {
killedBy: Número Conta conta com cinco dígitos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "número de conta inválida"

Received function did not throw

[Killed] ConditionalExpression
src/model/NumeroConta.ts:7:9
   private _numero: string;
 
   private validar(numero: string): void {
-    if (!this.temSeisDigitos(numero)) {
+    if (true) {
       throw new NegocioErro("número de conta inválida");
     }
killedBy: Número Conta conta com seis dígitos
statusReason: Error: número de conta inválida

[Killed] ConditionalExpression
src/model/NumeroConta.ts:7:9
   private _numero: string;
 
   private validar(numero: string): void {
-    if (!this.temSeisDigitos(numero)) {
+    if (false) {
       throw new NegocioErro("número de conta inválida");
     }
killedBy: Número Conta conta com cinco dígitos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "número de conta inválida"

Received function did not throw

[Killed] StringLiteral
src/model/NumeroConta.ts:8:29
 
   private validar(numero: string): void {
     if (!this.temSeisDigitos(numero)) {
-      throw new NegocioErro("número de conta inválida");
+      throw new NegocioErro("");
     }
   }
killedBy: Número Conta conta com cinco dígitos
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "número de conta inválida"
Received message:   ""

      59 |         } else {
      60 |           stryCov_9fa48("34");
    > 61 |           throw new NegocioErro(stryMutAct_9fa48("35") ? "" : (stryCov_9fa48("35"), "número de conta inválida"));

[Killed] BlockStatement
src/model/NumeroConta.ts:12:51
     }
   }
 
-  private temSeisDigitos(numero: string): boolean {
-    const regExp: RegExp = /^\d{6}$/;
-    return regExp.test(numero);
-  }
+  private temSeisDigitos(numero: string): boolean {}
 
   public constructor(numero: string) {
killedBy: Número Conta conta com seis dígitos
statusReason: Error: número de conta inválida

[Killed] Regex
src/model/NumeroConta.ts:13:28
   }
 
   private temSeisDigitos(numero: string): boolean {
-    const regExp: RegExp = /^\d{6}$/;
+    const regExp: RegExp = /^\D{6}$/;
     return regExp.test(numero);
   }
killedBy: Número Conta conta com seis dígitos
statusReason: Error: número de conta inválida

[Killed] BlockStatement
src/model/NumeroConta.ts:17:38
     return regExp.test(numero);
   }
 
-  public constructor(numero: string) {
-    this.validar(numero);
-    this._numero = numero;
-  }
+  public constructor(numero: string) {}
 
   public get numero(): string {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: conta de origem não encontrada

[Killed] BlockStatement
src/model/NumeroConta.ts:22:31
     this._numero = numero;
   }
 
-  public get numero(): string {
-    return this._numero;
-  }
+  public get numero(): string {}
 }
 
killedBy: Número Conta conta com seis dígitos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123456"
Received: undefined
