[Killed] BlockStatement
src/model/Recibo.ts:4:24
 export class Recibo {
   private _codigo: string;
 
-  public constructor() {
-    this._codigo = this.gerarCodigo();
-  }
+  public constructor() {}
 
   public get codigo(): string {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/model/Recibo.ts:8:31
     this._codigo = this.gerarCodigo();
   }
 
-  public get codigo(): string {
-    return this._codigo;
-  }
+  public get codigo(): string {}
 
   private gerarCodigo(): string {
killedBy: Transferência Serviço transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/model/Recibo.ts:12:33
     return this._codigo;
   }
 
-  private gerarCodigo(): string {
-    return Math.floor(Math.random() * 899999 + 100000).toString();
-  }
+  private gerarCodigo(): string {}
 }
 
killedBy: Recibo criar com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArithmeticOperator
src/model/Recibo.ts:13:23
   }
 
   private gerarCodigo(): string {
-    return Math.floor(Math.random() * 899999 + 100000).toString();
+    return Math.floor(Math.random() * 899999 - 100000).toString();
   }
 }
killedBy: Transferência Serviço transferir com sucesso
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ArithmeticOperator
src/model/Recibo.ts:13:23
   }
 
   private gerarCodigo(): string {
-    return Math.floor(Math.random() * 899999 + 100000).toString();
+    return Math.floor(Math.random() / 899999 + 100000).toString();
   }
 }
killedBy: Recibo criar recibos diferentes
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "100000"
