[Killed] BlockStatement
src/model/service/TransferenciaValor.ts:9:13
     contaOrigem: Conta,
     contaDestino: Conta,
     valor: number
-  ): Recibo {
-    contaOrigem.sacar(valor);
-    contaDestino.depositar(valor);
-    return new Recibo();
-  }
+  ): Recibo {}
 }
 
killedBy: Transferência Serviço transferir com sucesso
statusReason: TypeError: Cannot read properties of undefined (reading 'codigo')
